zephyrproject-rtos/hal_microchip/include/dt-bindings/pic32c/pic32ck_sg_gc/pic32ck_sg01/pic32ck2051sg01100-pinctrl.h
/*
 * Copyright (c) 2026 Microchip Technology Inc.
 *
 * SPDX-License-Identifier: Apache-2.0
 *
 * Autogenerated file
 */

#ifndef MICROCHIP_PIC32CK2051SG01100_PINCTRL_H_
#define MICROCHIP_PIC32CK2051SG01100_PINCTRL_H_

#include <dt-bindings/pic32c/pic32ck_sg_gc/common/mchp_pinctrl_pinmux_pic32c.h>

#define PA0_GPIO MCHP_PINMUX(a, 0, gpio, gpio)

#define PA0A_EIC_EXTINT14 MCHP_PINMUX(a, 0, a, periph)

#define PA0D_SERCOM6_PAD0 MCHP_PINMUX(a, 0, d, periph)

#define PA0F_TCC2_WO0 MCHP_PINMUX(a, 0, f, periph)

#define PA0G_BSDAP_TDI MCHP_PINMUX(a, 0, g, periph)

#define PA1_GPIO MCHP_PINMUX(a, 1, gpio, gpio)

#define PA1A_EIC_EXTINT1 MCHP_PINMUX(a, 1, a, periph)

#define PA1C_SERCOM7_PAD0 MCHP_PINMUX(a, 1, c, periph)

#define PA1D_SERCOM6_PAD1 MCHP_PINMUX(a, 1, d, periph)

#define PA1F_TCC2_WO3 MCHP_PINMUX(a, 1, f, periph)

#define PA1G_BSDAP_TDO MCHP_PINMUX(a, 1, g, periph)

#define PA1M_GCLK_IO1 MCHP_PINMUX(a, 1, m, periph)

#define PA2_GPIO MCHP_PINMUX(a, 2, gpio, gpio)

#define PA2A_EIC_EXTINT2 MCHP_PINMUX(a, 2, a, periph)

#define PA2D_SERCOM6_PAD2 MCHP_PINMUX(a, 2, d, periph)

#define PA2G_BSDAP_TMS_SWDIO MCHP_PINMUX(a, 2, g, periph)

#define PA3_GPIO MCHP_PINMUX(a, 3, gpio, gpio)

#define PA3A_EIC_EXTINT3 MCHP_PINMUX(a, 3, a, periph)

#define PA3D_SERCOM6_PAD3 MCHP_PINMUX(a, 3, d, periph)

#define PA3G_BSDAP_TCK_SWCLK MCHP_PINMUX(a, 3, g, periph)

#define PA3M_GCLK_IO0 MCHP_PINMUX(a, 3, m, periph)

#define PA4_GPIO MCHP_PINMUX(a, 4, gpio, gpio)

#define PA4A_EIC_EXTINT4 MCHP_PINMUX(a, 4, a, periph)

#define PA4B_ADC_VINP0 MCHP_PINMUX(a, 4, b, periph)

#define PA4C_SERCOM7_PAD1 MCHP_PINMUX(a, 4, c, periph)

#define PA4E_EBI_D5 MCHP_PINMUX(a, 4, e, periph)

#define PA4F_TCC3_WO0 MCHP_PINMUX(a, 4, f, periph)

#define PA4M_CCL_IN9 MCHP_PINMUX(a, 4, m, periph)

#define PA5_GPIO MCHP_PINMUX(a, 5, gpio, gpio)

#define PA5A_EIC_EXTINT5 MCHP_PINMUX(a, 5, a, periph)

#define PA5B_ADC_VINM0 MCHP_PINMUX(a, 5, b, periph)

#define PA5B_ADC_VINP1 MCHP_PINMUX(a, 5, b, periph)

#define PA5C_SERCOM7_PAD2 MCHP_PINMUX(a, 5, c, periph)

#define PA5D_SERCOM5_PAD0 MCHP_PINMUX(a, 5, d, periph)

#define PA5E_EBI_D6 MCHP_PINMUX(a, 5, e, periph)

#define PA5F_TCC3_WO1 MCHP_PINMUX(a, 5, f, periph)

#define PA5M_CCL_IN10 MCHP_PINMUX(a, 5, m, periph)

#define PA6_GPIO MCHP_PINMUX(a, 6, gpio, gpio)

#define PA6A_EIC_EXTINT6 MCHP_PINMUX(a, 6, a, periph)

#define PA6B_AC_AIN0 MCHP_PINMUX(a, 6, b, periph)

#define PA6B_ADC_VINP2 MCHP_PINMUX(a, 6, b, periph)

#define PA6C_SERCOM7_PAD3 MCHP_PINMUX(a, 6, c, periph)

#define PA6D_SERCOM5_PAD1 MCHP_PINMUX(a, 6, d, periph)

#define PA6E_EBI_D7 MCHP_PINMUX(a, 6, e, periph)

#define PA6F_TCC3_WO2 MCHP_PINMUX(a, 6, f, periph)

#define PA6M_CCL_IN11 MCHP_PINMUX(a, 6, m, periph)

#define PA7_GPIO MCHP_PINMUX(a, 7, gpio, gpio)

#define PA7A_EIC_EXTINT7 MCHP_PINMUX(a, 7, a, periph)

#define PA7B_AC_AIN1 MCHP_PINMUX(a, 7, b, periph)

#define PA7B_ADC_VINM2 MCHP_PINMUX(a, 7, b, periph)

#define PA7B_ADC_VINP3 MCHP_PINMUX(a, 7, b, periph)

#define PA7C_SERCOM6_PAD0 MCHP_PINMUX(a, 7, c, periph)

#define PA7D_SERCOM5_PAD2 MCHP_PINMUX(a, 7, d, periph)

#define PA7E_EBI_D8 MCHP_PINMUX(a, 7, e, periph)

#define PA7F_TCC3_WO3 MCHP_PINMUX(a, 7, f, periph)

#define PA7M_CCL_OUT3 MCHP_PINMUX(a, 7, m, periph)

#define PA8_GPIO MCHP_PINMUX(a, 8, gpio, gpio)

#define PA8A_EIC_EXTINT8 MCHP_PINMUX(a, 8, a, periph)

#define PA8B_ADC_VINP4 MCHP_PINMUX(a, 8, b, periph)

#define PA8C_SERCOM6_PAD1 MCHP_PINMUX(a, 8, c, periph)

#define PA8D_SERCOM5_PAD3 MCHP_PINMUX(a, 8, d, periph)

#define PA8E_EBI_D9 MCHP_PINMUX(a, 8, e, periph)

#define PA8F_TCC3_WO4 MCHP_PINMUX(a, 8, f, periph)

#define PA9_GPIO MCHP_PINMUX(a, 9, gpio, gpio)

#define PA9A_EIC_EXTINT9 MCHP_PINMUX(a, 9, a, periph)

#define PA9B_ADC_VINP5 MCHP_PINMUX(a, 9, b, periph)

#define PA9C_SERCOM6_PAD2 MCHP_PINMUX(a, 9, c, periph)

#define PA9D_SERCOM6_PAD3 MCHP_PINMUX(a, 9, d, periph)

#define PA9G_TCC3_WO0 MCHP_PINMUX(a, 9, g, periph)

#define PA9J_SPI_IXS_FSYNC MCHP_PINMUX(a, 9, j, periph)

#define PA9M_GCLK_IO0 MCHP_PINMUX(a, 9, m, periph)

#define PA9N_PTC_DRV0 MCHP_PINMUX(a, 9, n, periph)

#define PA10_GPIO MCHP_PINMUX(a, 10, gpio, gpio)

#define PA10A_EIC_EXTINT10 MCHP_PINMUX(a, 10, a, periph)

#define PA10B_ADC_VINP6 MCHP_PINMUX(a, 10, b, periph)

#define PA10C_SERCOM6_PAD3 MCHP_PINMUX(a, 10, c, periph)

#define PA10E_EBI_NWAIT MCHP_PINMUX(a, 10, e, periph)

#define PA10G_TCC3_WO1 MCHP_PINMUX(a, 10, g, periph)

#define PA10H_SQI_CS2 MCHP_PINMUX(a, 10, h, periph)

#define PA10I_SDMMC0_SDCD MCHP_PINMUX(a, 10, i, periph)

#define PA10K_PCC_DEN1 MCHP_PINMUX(a, 10, k, periph)

#define PA10M_GCLK_IO1 MCHP_PINMUX(a, 10, m, periph)

#define PA10N_PTC_DRV1 MCHP_PINMUX(a, 10, n, periph)

#define PA11_GPIO MCHP_PINMUX(a, 11, gpio, gpio)

#define PA11A_EIC_EXTINT11 MCHP_PINMUX(a, 11, a, periph)

#define PA11B_ADC_VINP7 MCHP_PINMUX(a, 11, b, periph)

#define PA11C_SERCOM5_PAD0 MCHP_PINMUX(a, 11, c, periph)

#define PA11D_SERCOM7_PAD1 MCHP_PINMUX(a, 11, d, periph)

#define PA11F_TCC4_WO0 MCHP_PINMUX(a, 11, f, periph)

#define PA11G_TCC3_WO2 MCHP_PINMUX(a, 11, g, periph)

#define PA11J_SPI_IXS_SCK MCHP_PINMUX(a, 11, j, periph)

#define PA11L_ETH_MDC MCHP_PINMUX(a, 11, l, periph)

#define PA11M_AC_CMP0 MCHP_PINMUX(a, 11, m, periph)

#define PA11N_PTC_DRV2 MCHP_PINMUX(a, 11, n, periph)

#define PA12_GPIO MCHP_PINMUX(a, 12, gpio, gpio)

#define PA12A_EIC_EXTINT12 MCHP_PINMUX(a, 12, a, periph)

#define PA12B_ADC_VINP8 MCHP_PINMUX(a, 12, b, periph)

#define PA12C_SERCOM5_PAD1 MCHP_PINMUX(a, 12, c, periph)

#define PA12D_SERCOM7_PAD0 MCHP_PINMUX(a, 12, d, periph)

#define PA12F_TCC4_WO1 MCHP_PINMUX(a, 12, f, periph)

#define PA12G_TCC3_WO3 MCHP_PINMUX(a, 12, g, periph)

#define PA12I_SDMMC0_SDCD MCHP_PINMUX(a, 12, i, periph)

#define PA12J_SPI_IXS_SDI MCHP_PINMUX(a, 12, j, periph)

#define PA12L_ETH_MDIO MCHP_PINMUX(a, 12, l, periph)

#define PA12M_AC_CMP1 MCHP_PINMUX(a, 12, m, periph)

#define PA12N_PTC_DRV3 MCHP_PINMUX(a, 12, n, periph)

#define PA13_GPIO MCHP_PINMUX(a, 13, gpio, gpio)

