zephyrproject-rtos/hal_microchip/include/dt-bindings/pic32c/pic32ck_sg_gc/pic32ck_sg01/pic32ck2051sg01100-pinctrl.h
#define PC6H_CAN1_TX MCHP_PINMUX(c, 6, h, periph)

#define PC6L_ETH_RXD1 MCHP_PINMUX(c, 6, l, periph)

#define PC6N_PTC_DRV16 MCHP_PINMUX(c, 6, n, periph)

#define PC7_GPIO MCHP_PINMUX(c, 7, gpio, gpio)

#define PC7A_EIC_EXTINT7 MCHP_PINMUX(c, 7, a, periph)

#define PC7B_AC_AIN3 MCHP_PINMUX(c, 7, b, periph)

#define PC7C_SERCOM2_PAD1 MCHP_PINMUX(c, 7, c, periph)

#define PC7D_SERCOM3_PAD0 MCHP_PINMUX(c, 7, d, periph)

#define PC7G_TCC1_WO2 MCHP_PINMUX(c, 7, g, periph)

#define PC7H_CAN1_RX MCHP_PINMUX(c, 7, h, periph)

#define PC7L_ETH_RXD0 MCHP_PINMUX(c, 7, l, periph)

#define PC7N_PTC_DRV17 MCHP_PINMUX(c, 7, n, periph)

#define PC9_GPIO MCHP_PINMUX(c, 9, gpio, gpio)

#define PC9A_EIC_EXTINT9 MCHP_PINMUX(c, 9, a, periph)

#define PC9C_SERCOM2_PAD2 MCHP_PINMUX(c, 9, c, periph)

#define PC9D_SERCOM3_PAD2 MCHP_PINMUX(c, 9, d, periph)

#define PC9G_TCC1_WO3 MCHP_PINMUX(c, 9, g, periph)

#define PC9L_ETH_RXER MCHP_PINMUX(c, 9, l, periph)

#define PC9M_AC_CMP0 MCHP_PINMUX(c, 9, m, periph)

#define PC9N_PTC_DRV19 MCHP_PINMUX(c, 9, n, periph)

#define PC10_GPIO MCHP_PINMUX(c, 10, gpio, gpio)

#define PC10A_EIC_EXTINT10 MCHP_PINMUX(c, 10, a, periph)

#define PC10C_SERCOM0_PAD0 MCHP_PINMUX(c, 10, c, periph)

#define PC10D_SERCOM2_PAD1 MCHP_PINMUX(c, 10, d, periph)

#define PC10G_TCC1_WO5 MCHP_PINMUX(c, 10, g, periph)

#define PC10L_ETH_RXDV MCHP_PINMUX(c, 10, l, periph)

#define PC10M_CCL_IN3 MCHP_PINMUX(c, 10, m, periph)

#define PC10N_PTC_DRV20 MCHP_PINMUX(c, 10, n, periph)

#define PC11_GPIO MCHP_PINMUX(c, 11, gpio, gpio)

#define PC11A_EIC_EXTINT11 MCHP_PINMUX(c, 11, a, periph)

#define PC11C_SERCOM0_PAD1 MCHP_PINMUX(c, 11, c, periph)

#define PC11D_SERCOM2_PAD0 MCHP_PINMUX(c, 11, d, periph)

#define PC11G_TCC1_WO6 MCHP_PINMUX(c, 11, g, periph)

#define PC11L_ETH_TXEN MCHP_PINMUX(c, 11, l, periph)

#define PC11M_CCL_IN4 MCHP_PINMUX(c, 11, m, periph)

#define PC11N_PTC_DRV21 MCHP_PINMUX(c, 11, n, periph)

#define PC12_GPIO MCHP_PINMUX(c, 12, gpio, gpio)

#define PC12A_EIC_EXTINT12 MCHP_PINMUX(c, 12, a, periph)

#define PC12C_SERCOM0_PAD2 MCHP_PINMUX(c, 12, c, periph)

#define PC12D_SERCOM2_PAD2 MCHP_PINMUX(c, 12, d, periph)

#define PC12G_TCC1_WO7 MCHP_PINMUX(c, 12, g, periph)

#define PC12L_ETH_TXD0 MCHP_PINMUX(c, 12, l, periph)

#define PC12M_CCL_IN5 MCHP_PINMUX(c, 12, m, periph)

#define PC12N_PTC_DRV22 MCHP_PINMUX(c, 12, n, periph)

#define PC13_GPIO MCHP_PINMUX(c, 13, gpio, gpio)

#define PC13A_EIC_EXTINT13 MCHP_PINMUX(c, 13, a, periph)

#define PC13C_SERCOM0_PAD3 MCHP_PINMUX(c, 13, c, periph)

#define PC13D_SERCOM2_PAD3 MCHP_PINMUX(c, 13, d, periph)

#define PC13L_ETH_TXD1 MCHP_PINMUX(c, 13, l, periph)

#define PC13M_CCL_OUT1 MCHP_PINMUX(c, 13, m, periph)

#define PC13N_PTC_DRV18 MCHP_PINMUX(c, 13, n, periph)

#define PC14_GPIO MCHP_PINMUX(c, 14, gpio, gpio)

#define PC14A_EIC_EXTINT14 MCHP_PINMUX(c, 14, a, periph)

#define PC14C_SERCOM2_PAD2 MCHP_PINMUX(c, 14, c, periph)

#define PC14E_EBI_A8 MCHP_PINMUX(c, 14, e, periph)

#define PC14K_PCC_DEN2 MCHP_PINMUX(c, 14, k, periph)

#define PC14L_ETH_RXD3 MCHP_PINMUX(c, 14, l, periph)

#define PC14N_PTC_DRV26 MCHP_PINMUX(c, 14, n, periph)

#define PC15_GPIO MCHP_PINMUX(c, 15, gpio, gpio)

#define PC15A_EIC_EXTINT15 MCHP_PINMUX(c, 15, a, periph)

#define PC15C_SERCOM2_PAD0 MCHP_PINMUX(c, 15, c, periph)

#define PC15D_SERCOM3_PAD3 MCHP_PINMUX(c, 15, d, periph)

#define PC15E_EBI_A6 MCHP_PINMUX(c, 15, e, periph)

#define PC15F_TCC1_WO0 MCHP_PINMUX(c, 15, f, periph)

#define PC15G_TCC1_WO4 MCHP_PINMUX(c, 15, g, periph)

#define PC15K_PCC_DATA8 MCHP_PINMUX(c, 15, k, periph)

#define PC15L_ETH_RX_CLK MCHP_PINMUX(c, 15, l, periph)

#define PC15M_AC_CMP1 MCHP_PINMUX(c, 15, m, periph)

#define PC15N_PTC_DRV27 MCHP_PINMUX(c, 15, n, periph)

#define PC16_GPIO MCHP_PINMUX(c, 16, gpio, gpio)

#define PC16A_EIC_EXTINT0 MCHP_PINMUX(c, 16, a, periph)

#define PC16C_SERCOM2_PAD1 MCHP_PINMUX(c, 16, c, periph)

#define PC16E_EBI_A5 MCHP_PINMUX(c, 16, e, periph)

#define PC16F_TCC1_WO1 MCHP_PINMUX(c, 16, f, periph)

#define PC16K_PCC_DATA9 MCHP_PINMUX(c, 16, k, periph)

#define PC16L_ETH_TXER MCHP_PINMUX(c, 16, l, periph)

#define PC16N_PTC_DRV28 MCHP_PINMUX(c, 16, n, periph)

#define PC17_GPIO MCHP_PINMUX(c, 17, gpio, gpio)

#define PC17A_EIC_EXTINT1 MCHP_PINMUX(c, 17, a, periph)

#define PC17C_SERCOM2_PAD2 MCHP_PINMUX(c, 17, c, periph)

#define PC17E_EBI_A4 MCHP_PINMUX(c, 17, e, periph)

#define PC17F_TCC1_WO2 MCHP_PINMUX(c, 17, f, periph)

#define PC17K_PCC_DATA10 MCHP_PINMUX(c, 17, k, periph)

#define PC17L_ETH_CRS MCHP_PINMUX(c, 17, l, periph)

#define PC17N_PTC_DRV29 MCHP_PINMUX(c, 17, n, periph)

#define PC18_GPIO MCHP_PINMUX(c, 18, gpio, gpio)

#define PC18A_EIC_EXTINT2 MCHP_PINMUX(c, 18, a, periph)

#define PC18C_SERCOM2_PAD3 MCHP_PINMUX(c, 18, c, periph)

#define PC18E_EBI_A3 MCHP_PINMUX(c, 18, e, periph)

#define PC18F_TCC1_WO3 MCHP_PINMUX(c, 18, f, periph)

#define PC18K_PCC_DATA11 MCHP_PINMUX(c, 18, k, periph)

#define PC18L_ETH_COL MCHP_PINMUX(c, 18, l, periph)

#define PC18N_PTC_DRV30 MCHP_PINMUX(c, 18, n, periph)

#define PC19_GPIO MCHP_PINMUX(c, 19, gpio, gpio)

#define PC19A_EIC_EXTINT3 MCHP_PINMUX(c, 19, a, periph)

#define PC19E_EBI_A2 MCHP_PINMUX(c, 19, e, periph)

#define PC19F_TCC1_WO4 MCHP_PINMUX(c, 19, f, periph)

#define PC19K_PCC_DATA12 MCHP_PINMUX(c, 19, k, periph)

#define PC19L_ETH_TXD2 MCHP_PINMUX(c, 19, l, periph)

#define PC19N_PTC_DRV31 MCHP_PINMUX(c, 19, n, periph)

#define PC20_GPIO MCHP_PINMUX(c, 20, gpio, gpio)

#define PC20A_EIC_EXTINT4 MCHP_PINMUX(c, 20, a, periph)

#define PC20E_EBI_NBS2_NWR2_A1 MCHP_PINMUX(c, 20, e, periph)

#define PC20F_TCC1_WO5 MCHP_PINMUX(c, 20, f, periph)

#define PC20K_PCC_DATA13 MCHP_PINMUX(c, 20, k, periph)

#define PC20L_ETH_TXD3 MCHP_PINMUX(c, 20, l, periph)

#define PC20N_PTC_DRV23 MCHP_PINMUX(c, 20, n, periph)

#define PD0_GPIO MCHP_PINMUX(d, 0, gpio, gpio)

#define PD0A_EIC_EXTINT0 MCHP_PINMUX(d, 0, a, periph)

#define PD1_GPIO MCHP_PINMUX(d, 1, gpio, gpio)

#define PD1A_EIC_EXTINT1 MCHP_PINMUX(d, 1, a, periph)

#define PD2_GPIO MCHP_PINMUX(d, 2, gpio, gpio)

#define PD2A_EIC_NMI MCHP_PINMUX(d, 2, a, periph)

